In [9]:
import pandas as pd
import numpy as np

In [2]:
data = pd.Series([1, 2, 3, 4, 5])
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
data = pd.Series([1, 2, 3, 4, 5])
data_list = data.tolist()
print("Converted list:", data_list)
print("Type of list:", type(data_list))

Converted list: [1, 2, 3, 4, 5]
Type of list: <class 'list'>

In [26]:
data1 = pd.Series([1, 2, 3, 4, 5])
data2 = pd.Series([1, 3, 3, 5, 5])
com = data1 == data2
com

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [32]:
data = {'A': [1, 2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e']}
df = pd.DataFrame(data)
print("Original DataFrame:")
df

Original DataFrame:

   A  B
0  1  a
1  2  b
2  3  c
3  4  d
4  5  e

In [30]:
data = {'X': [78, 85, 96, 80, 86], 'Y': [84, 94, 89, 83, 86], 'Z': [86, 97, 96, 72, 83]}
df = pd.DataFrame(data)
powers = [2]
powered_data = df.apply(lambda x, p: x**p, args=(powers,))
print("Original DataFrame:")
df

Original DataFrame:

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [33]:
df['A'] = df['A'].astype(float)
print("\nModified DataFrame:")
df

Modified DataFrame:

     A  B
0  1.0  a
1  2.0  b
2  3.0  c
3  4.0  d
4  5.0  e

In [28]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)

first_3_rows = df.head(3)
first_3_rows

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [31]:
print("Powered values:")
powered_data

Powered values:

      X     Y     Z
0  6084  7056  7396
1  7225  8836  9409
2  9216  7921  9216
3  6400  6889  5184
4  7396  7396  6889

In [35]:
df.set_index('name', inplace=True)
df

           score  attempts qualify
name
Anastasia   12.5         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes

In [34]:
data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
df = pd.DataFrame(data)
print("Default Index:")
df

Default Index:

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [40]:
df.reset_index(inplace=True)
print("DataFrame with the index reset:")
df

DataFrame with the index reset:

   level_0  index       name  score  attempts qualify
0        0      0  Anastasia   12.5         1     yes
1        1      1       Dima    9.0         3      no
2        2      2  Katherine   16.5         2     yes
3        3      3      James    NaN         3      no
4        4      4      Emily    9.0         2      no
5        5      5    Michael   20.0         3     yes
6        6      6    Matthew   14.5         1     yes
7        7      7      Laura    NaN         1      no
8        8      8      Kevin    8.0         2      no
9        9      9      Jonas   19.0         1     yes

In [42]:
df = pd.DataFrame(data)
date_range = pd.date_range('15/05/2002 ', periods=5, freq='H')
data = {'value': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data, index=date_range)
df

                     value
2002-05-15 00:00:00     10
2002-05-15 01:00:00     20
2002-05-15 02:00:00     30
2002-05-15 03:00:00     40
2002-05-15 04:00:00     50

In [44]:
df = pd.DataFrame(data)
df = df.rename_axis('Index Column Name')
df

                   value
Index Column Name
0                     10
1                     20
2                     30
3                     40
4                     50

In [45]:
df = pd.DataFrame(data)
specific_row = df.iloc[2]
print("Selected row:")
specific_row

Selected row:

value    30
Name: 2, dtype: int64

In [46]:
df = pd.DataFrame(data)
specific_row = df.iloc[2]
print("Selected row:")
specific_row

Selected row:

value    30
Name: 2, dtype: int64